{"q": "What is Dharma?", "a": "Dharma means righteousness and duty."}
{"q":"What is Hinduism?","a":"Hinduism, also known as Sanatana Dharma, is the oldest living religion in the world. It is a diverse spiritual tradition that includes philosophies, rituals, devotion, yoga, and meditation."}
{"q":"What does Sanatana Dharma mean?","a":"Sanatana Dharma means the eternal duty or eternal law. It refers to timeless spiritual truths that govern the universe and human life."}
{"q":"What is Dharma?","a":"Dharma means righteousness, duty, moral order, and the correct way of living according to cosmic law."}
{"q":"What is Karma?","a":"Karma is the universal law of cause and effect. Every action, thought, and intention produces consequences in this life or future lives."}
{"q":"What is Samsara?","a":"Samsara is the endless cycle of birth, death, and rebirth governed by karma."}
{"q":"What is Moksha?","a":"Moksha is liberation from Samsara. It is the ultimate goal of life where the soul realizes its true nature and becomes free from rebirth."}
{"q":"What is Atman?","a":"Atman is the true self or soul. It is eternal, pure consciousness, and distinct from the physical body and mind."}
{"q":"What is Brahman?","a":"Brahman is the ultimate, infinite, formless reality that is the source of all existence."}
{"q":"What is Advaita Vedanta?","a":"Advaita Vedanta is a philosophy that teaches non-duality, stating that Atman and Brahman are one and the same."}
{"q":"Who is Adi Shankaracharya?","a":"Adi Shankaracharya was an 8th-century philosopher who consolidated the philosophy of Advaita Vedanta."}
{"q":"Who is Lord Brahma?","a":"Brahma is the creator god in Hinduism and part of the Trimurti."}
{"q":"Who is Lord Vishnu?","a":"Vishnu is the preserver of the universe and protector of Dharma. He incarnates as avatars to restore cosmic balance."}
{"q":"Who is Lord Shiva?","a":"Shiva is the destroyer and transformer. He represents meditation, renunciation, and cosmic consciousness."}
{"q":"What is the Trimurti?","a":"The Trimurti consists of Brahma the Creator, Vishnu the Preserver, and Shiva the Destroyer."}
{"q":"Who is Lord Krishna?","a":"Krishna is the eighth avatar of Vishnu and the speaker of the Bhagavad Gita. He represents divine love and wisdom."}
{"q":"Who is Lord Rama?","a":"Rama is the seventh avatar of Vishnu and the hero of the Ramayana, symbolizing ideal conduct and righteousness."}
{"q":"Who is Goddess Lakshmi?","a":"Lakshmi is the goddess of wealth, prosperity, and fortune, and the consort of Vishnu."}
{"q":"Who is Goddess Saraswati?","a":"Saraswati is the goddess of knowledge, wisdom, music, and learning."}
{"q":"Who is Goddess Durga?","a":"Durga is the divine mother who protects the universe and destroys evil forces."}
{"q":"Who is Lord Ganesha?","a":"Ganesha is the remover of obstacles and the god of wisdom, intellect, and new beginnings."}
{"q":"Who is Lord Hanuman?","a":"Hanuman is a symbol of strength, devotion, and selfless service, and a devotee of Lord Rama."}
{"q":"What is the Ramayana?","a":"The Ramayana is an epic that narrates the life of Lord Rama and his victory over Ravana."}
{"q":"What is the Mahabharata?","a":"The Mahabharata is a great epic that describes the Kurukshetra war and contains the Bhagavad Gita."}
{"q":"What is the Bhagavad Gita?","a":"The Bhagavad Gita is a sacred dialogue between Krishna and Arjuna that teaches duty, devotion, and liberation."}
{"q":"What are the Vedas?","a":"The Vedas are the oldest sacred scriptures of Hinduism, consisting of Rigveda, Yajurveda, Samaveda, and Atharvaveda."}
{"q":"What are the Upanishads?","a":"The Upanishads are philosophical texts that explore the nature of reality, Atman, and Brahman."}
{"q":"What is Yoga?","a":"Yoga is a spiritual discipline that unites body, mind, and soul through practice and meditation."}
{"q":"What is Bhakti Yoga?","a":"Bhakti Yoga is the path of devotion and love toward God."}
{"q":"What is Karma Yoga?","a":"Karma Yoga is the path of selfless action performed without attachment to results."}
{"q":"What is Jnana Yoga?","a":"Jnana Yoga is the path of knowledge and self-inquiry."}
{"q":"What is Raja Yoga?","a":"Raja Yoga is the path of meditation and control of the mind."}
{"q":"What is Maya?","a":"Maya is the cosmic illusion that causes beings to perceive the temporary world as ultimate reality."}
{"q":"What is Ahimsa?","a":"Ahimsa is the principle of non-violence in thought, word, and action."}
{"q":"What is Puja?","a":"Puja is a ritual of worship performed to honor and communicate with the divine."}
{"q":"What is Prasad?","a":"Prasad is food offered to a deity and then shared as a blessing."}
{"q":"What is a Guru?","a":"A Guru is a spiritual teacher who guides a disciple toward self-realization."}
{"q":"What is a Mantra?","a":"A Mantra is a sacred sound or phrase chanted for spiritual transformation."}
{"q":"What is Om?","a":"Om is the primordial sound symbolizing the ultimate reality."}
{"q":"What is Yajna?","a":"Yajna is a sacred fire ritual performed with offerings and mantras."}
{"q":"What is a Temple?","a":"A Hindu temple is a sacred space designed to connect humans with the divine."}
{"q":"What is a Sannyasi?","a":"A Sannyasi is one who renounces worldly life in pursuit of liberation."}
{"q":"What is Varna system?","a":"The Varna system categorizes society based on duties: Brahmin, Kshatriya, Vaishya, and Shudra."}
{"q":"What is Diwali?","a":"Diwali is the festival of lights symbolizing victory of light over darkness."}
{"q":"What is Holi?","a":"Holi is the festival of colors celebrating joy and the triumph of good over evil."}
{"q":"What is Navaratri?","a":"Navaratri is a nine-night festival honoring the divine feminine."}
{"q":"What is Raksha Bandhan?","a":"Raksha Bandhan celebrates the bond between brothers and sisters."}
{"q":"Who is Yama?","a":"Yama is the god of death and justice who judges souls after death."}
{"q":"What is Swastika in Hinduism?","a":"The Swastika is an ancient symbol of auspiciousness and well-being in Hinduism."}
